Autodesk.Revit.DB.GeometryObject.getReferenceForAPIUser
This overload powers the Reference properties which return the reference directly to the user.

Autodesk.Revit.DB.GeometryObject.GetHashCode
Gets the integer value of the geometry object as hash code

Autodesk.Revit.DB.GeometryObject.Equals(System.Object)
Determines whether the specified System.Object is equal to the current System.Object.
Remarks: This compares the internal identifiers of the geometry, and doesn't compare them geometrically.
obj:  Another object.

Autodesk.Revit.DB.GeometryObject.op_Inequality(Autodesk.Revit.DB.GeometryObject,Autodesk.Revit.DB.GeometryObject)
Determines whether two GeometryObjects are different.
Remarks: This compares the internal identifiers of the geometry, and doesn't compare them geometrically.
first: The first GeometryObject.
second: The second GeometryObject.
Returns: True if the GeometryObjects are different; otherwise, false.

Autodesk.Revit.DB.GeometryObject.op_Equality(Autodesk.Revit.DB.GeometryObject,Autodesk.Revit.DB.GeometryObject)
Determines whether two GeometryObjects are the same.
Remarks: This compares the internal identifiers of the geometry, and doesn't compare them geometrically.
first: The first GeometryObject.
second: The second GeometryObject.
Returns: True if the GeometryObjects are the same; otherwise, false.

Autodesk.Revit.DB.GeometryObject.IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
Since: 2012

Autodesk.Revit.DB.GeometryObject.GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
Remarks: This property provides the id of the GraphicsStyle assigned to the GeometryObject.
This can be used to find the category of the object.
Since: 2012

Autodesk.Revit.DB.GeometryObject.Visibility
The visibility.
Remarks: The visibility of this object has no effect on the visibility of objects contained within this object.
For example, the visibility of a Solid may be Contextual but the faces within that solid may still be Visible.

Autodesk.Revit.DB.GeometryObject
The common base class for all geometric primitives.